In [1]:
import numpy as np 
import pandas as pd

In [8]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [9]:
sozluk = {"var1": s1, "var2": s2, "var3": s3 }
sozluk

{'var1': array([8, 8, 6, 8, 4]),
 'var2': array([1, 3, 9, 7, 4]),
 'var3': array([2, 9, 5, 6, 6])}

In [10]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     1     2
1     8     3     9
2     6     9     5
3     8     7     6
4     4     4     6

In [9]:
df[0:1]

   var1  var2  var3
0     2     2     7

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     8     1     2
b     8     3     9
c     6     9     5
d     8     7     6
e     4     4     6

In [14]:
df[0:1]

   var1  var2  var3
a     2     2     7

In [15]:
df["c":"e"]

   var1  var2  var3
c     5     7     6
d     8     5     2
e     3     0     2

In [16]:
df.drop("a", axis=0)

   var1  var2  var3
b     1     3     6
c     5     7     6
d     8     5     2
e     3     0     2

In [15]:
df.drop("a", axis=0, inplace = True) ##inplase = True argümanı silme işlemini kalıcı hale getirir.
df

   var1  var2  var3
b     8     3     9
c     6     9     5
d     8     7     6
e     4     4     6

In [16]:
df

   var1  var2  var3
b     8     3     9
c     6     9     5
d     8     7     6
e     4     4     6

In [17]:
l = ["b", "d"]

In [18]:
df

   var1  var2  var3
b     8     3     9
c     6     9     5
d     8     7     6
e     4     4     6

In [19]:
df.drop(l, axis= 0 )

   var1  var2  var3
c     6     9     5
e     4     4     6

In [21]:
"var1" in df

True

In [22]:
df

   var1  var2  var3
b     8     3     9
c     6     9     5
d     8     7     6
e     4     4     6

In [24]:
df["var4"] = df["var2"] * df["var3"]
df

   var1  var2  var3  var4
b     8     3     9    27
c     6     9     5    45
d     8     7     6    42
e     4     4     6    24

In [25]:
df.drop("var4", axis=1, inplace=True)
df

   var1  var2  var3
b     8     3     9
c     6     9     5
d     8     7     6
e     4     4     6